Repository: sgpthomas/hourglass
Catalog: po/extra/*.po
Languages: fr, pt, ru

source: Set alarms, timers, and stopwatches
fr: Définissez des alames, des minuteurs et des chronomètres
pt: Defina alarmes, temporizadores e cronômetros
ru: Ставьте будильники, таймеры и секундомеры

source: Timer
fr: Minuteur
pt: Temporizador
ru: Таймер

source: Timer;Time;Clock;Hourglass;Alarm;
fr: Minuteur;Heure;Horloge;Sablier;Alarme;
pt: Temporizador;Tempo;Relógio;Ampulheta;Alarme;
ru: Timer;Time;Clock;Hourglass;Alarm;Таймер;Время;Часы;Будильник;

source: Hourglass is a simple time keeping application that helps you easily set stopwatches, repeating alarms, and timers.
fr: Hourglass est une simple application de gestion du temps qui vous permet de définir facilement des chronomètres, des alarmes avec répétition et des minuteurs.
pt: O Hourglass é uma aplicação simples de manter o seu tempo e que o ajuda a definir facilmente cronômetros, alarmes e temporizadores.
ru: Hourglass — это простое приложение, которое позволяет легко устанавливать секундомеры, повторяющиеся будильники и таймеры.

source: Alarm View
ru: Будильник

source: Stopwatch View
ru: Секундомер

source: Timer View
ru: Таймер

source: Update Flatpak runtime version
ru: Обновлена версия Flatpak runtime

source: Translation updates:
fr: Mise à jour des traductions :
ru: Обновления переводов:

source: Update Italian translation (thanks to @albanobattistella)
ru: Обновлён итальянский перевод (спасибо @albanobattistella)

source: Update Japanese translation
ru: Обновлён японский перевод

source: Improve relative time handling
ru: Улучшена обработка относительного времени

source: Add additional categories other than ambiguous `Utility` in the desktop entry (thanks to @danrabbit)
ru: Добавлены дополнительные категории, кроме двусмысленной «Принадлежности» в записи рабочего стола (спасибо @danrabbit)

source: Show the window in the center of the display at the first launch
ru: Показ окна в центре экрана при первом запуске

source: Make styling more consistent between stopwatch and timer (thanks to @ChildishGiant)
ru: Стилизация между секундомером и таймером теперь более согласованная (спасибо @ChildishGiant)

source: Ring alarms only on repeated days (thanks to @nakotami)
ru: Звонить будильником только в повторяющиеся дни (спасибо @nakotami)

source: Fix the condition of closing the app window being reversed
ru: Исправлен обратный порядок условия закрытия окна приложения

source: Fix a regression that the app don't launch if you create a repeated alarm, close the app, and try to reopen it
ru: Исправлена ошибка, из-за которой приложение не запускалось, если вы создаёте повторяющийся будильник, закрываете приложение и пытаетесь снова открыть его

source: AlarmView: Organize displayed information
ru: Будильники: Организация отображаемой информации

source: This release contains small bug fixes and improvements:
ru: Этот релиз содержит небольшие исправления и улучшения:

source: Strict on sandbox permission
ru: Ужесточены разрешения песочницы

source: Rounded window corners and flat titlebar
ru: Закруглены углы окна и добавлен плоский заголовок окна

source: NewAlarmDialog: Add placeholder text for title entry
ru: Диалог добавления нового будильника: Добавлен текст-заполнитель ддя заголовка

source: Set shorter summary text in appdata
ru: Установка более короткого текста сводки в данных приложения

source: Use palette of elementary for branding color
ru: Использование палитры цветов elementary для цвета бренда

source: Make sure to select an alarm on removing/adding/editing it and startup
ru: Исправлена ошибка выделения будильников при удалении/добавлении/редактировании и при запуске

source: Clean code
ru: Почищен код

source: This release comes with numerous bug fixes &amp; improvements!
ru: Этот релиз содержит большое количество исправлений и улучшений!

source: Changes in Alarm:
ru: Изменения в будильнике:

source: Refresh weekday toggle activity when opening popover
ru: Обновление переключателя дней недели при открытии всплывающего окна

source: Notify on every 0 second
ru: Уведомлять каждые 0 секунд

source: Keep repeated alarms on and turn off one-time alarms after ringing
ru: Оставлять повторяющиеся будильники включёнными и выключать одноразовые будильники после звонка

source: Now alarm date is optional; if you don't specify date of the alarm, it will be notified at that time of today
ru: Теперь дата будильника не является обязательной. Если вы не укажете дату будильника, то он будет уведомлен в это время сегодня

source: Remove unused "update-frequency" gsettings key
ru: Убран неиспользуемый gsettings ключ «update-frequency»

source: Fix repeating alarms can't be disabled
ru: Исправлена проблема, когда повторяющиеся будильники не могли быть отключены

source: Explicitly set the year
ru: Явная установка года

source: Changes in Timer:
ru: Изменения в таймере:

source: Add Reset button
ru: Добавлена кнопка сброса

source: Support setting purpose of a timer
ru: Поддержка установки целей таймера

source: Lessen damages to your storage
ru: Уменьшен ущерб для вашего хранилища

source: Restore started time on end
ru: Восстанавливать начальное время при завершении

source: Make sure to iconify always when the timer is active
ru: Иконка теперь всегда активна, когда таймер активен

source: Other changes:
ru: Другие изменения:

source: Fix a regression that any key input no longer accepted
ru: Исправлена ошибка, из-за которой любой ввод с клавиатуры не принимался

source: Lessen window width by default
ru: Меньшая ширина окна по умолчанию

source: Fix the app exits if the window has been iconified
ru: Исправлено завершение работы приложения, если окно было выделено значком

source: Code refactoring
ru: Рефакторинг кода

source: Update translations
fr: Mise à jour des traductions
ru: Обновлены переводы

source: Publish the app to the new AppCenter on elementary OS 6 with the Flatpak manifest
fr: Publication de l'application dans le nouveau Centre d'Applications d'elementary OS avec le manifeste Flatpak
ru: Выпуск приложения в новый AppCenter на elementary OS 6 с Flatpak манифестом

source: Respect an elementary OS-wide dark preference
fr: Prise en compte du paramètre du thème sombre d'elementary OS
ru: Использовать предпочтение тёмной темы elementary OS

source: Now you can close the window with the shortcut key Ctrl+Q, while the daemon stays running in the background
fr: Désormais vous pouvez fermer la fenêtre avec le raccourci clavier Ctrl + Q, tandis que le service continue de s'exécuter en arrière-plan
ru: Теперь вы можете закрыть окно с помощью Ctrl+Q, с сервис продолжит работать в фоне

source: Fix unreadable font size in the Alarm view
fr: Correction de la taille de la police illisible dans la vue Alarme
ru: Исправлен нечитаемый шрифт в будильниках

source: Fix wrong OARS data
fr: Corrections des données OARS erronées
ru: Исправлены неправильные OARS данные

source: Move the delete button in the action bar
fr: Déplacement du bouton de suppression dans la barre d'action
ru: Кнопка удаления была перемещена в панель действий

source: Redesign app icons (big thanks to @Fatih20)
fr: Refonte des icônes de l'application (merci beaucoup à @Fatih20)
ru: Переработана иконка приложения (большое спасибо @Fatih20)

source: Update Brazilian Portuguese translation (by @gfavaro)
fr: Mise à jour des traduction en portugais brésilien (par @gfavaro)
ru: Обновлён бразильский-португальский перевод (от @gfavaro)

source: Fixes:
fr: Corrections :
ru: Исправления:

source: Fix a fatal regression that timer does not stop on 00:00:00
fr: Correction d'une régression qui empêchait le minuteur de s'arrêter à 00:00:00
ru: Исправлена критическая ошибка, когда таймер не останавливался на 00:00:00

source: Improvements:
fr: Améliorations :
ru: Улучшения:

source: StopWatch: Rewrite for efficiency and visibility
fr: Chronomètre : Réécriture pour plus d'efficacité et de visibilité
ru: Секундомер: Переписано для эффективности и видимости

source: Add :disabled pseudo-class to the .round-button class
fr: Ajout de la pseudo-classe :disabled à la classe .round-button
ru: Добавлен псевдо-класс :disabled к классу .round-button

source: Use icons for add/remove buttons
fr: Utilisation d'icônes pour les bouton d'ajout/suppression
ru: Использовать иконки для кнопок добавления/удаления

source: Update .desktop comment to be consistent with HIG (by @aljelly)
fr: Mise à jour du fichier .desktop pour mieux correspondres au normes HIG (par @aljelly)
ru: Обновлён перевод .desktop файла, чтобы следовать HIG (от @aljelly)

source: Change shortened format of weekdays (by @NathanBnm)
fr: Modification du format court des jours de la semaine (par @NathanBnm)
ru: Изменён формат дней недели на сокращённый (by @NathanBnm)

source: Improve look of create/edit alarm dialog
fr: Amélioration de l'apparence de la boîte de dialogue d'ajout/modification des alarmes
ru: Улучшен внешний вид диалога создания/редактирования будильника

source: Don't reset repeat setting on closing popover
fr: Le paramètre de répétition n'est plus réinitialisé à la fermeture de la fenêtre flottante
ru: Не сбрасывать настройки повтора при закрытии всплывающего окна

source: Fix DBus error at the first launch
fr: Correction de l'erreur DBus au premier lancement
ru: Исправлена ошибка DBus при первом запуске

source: Fix notification icon is not set
fr: Correction des icônes de notification
ru: Исправлена иконка уведомления

source: Fix left time shows unexpected values if set time is too big
fr: Correction du temps restant qui affichait des valeurs incorrectes si l'heure définie était trop grande
ru: Исправлена ошибка, когда в оставшемся времени показывалось неожиданное значение, если изначальное время слишком большое

source: Improve saving window state
fr: Amélioration de l'enregistrement de l'état de la fenêtre
ru: Улучшено сохранение состояния окна

source: Add French translation (by @NathanBnm)
fr: Ajout des traductions en français (par @NathanBnm)
ru: Добавлен французский перевод (от @NathanBnm)

source: Update Spanish translation (by @CCaroV)
fr: Mise à jour des traductions en espagnol (par @CCaroV)
ru: Обновлён испанский перевод (от @CCaroV)

source: Add Japanese translation
fr: Ajout des traductions en japonais
ru: Добавлен японский перевод

source: Add Portuguese-Portugal translation (by @rottenpants466)
fr: Ajout des traductions en portugais brésilien (par @rottenpants466)
ru: Добавлен португальский перевод (от @rottenpants466)

source: Other updates:
fr: Autres mises à jour :
ru: Другие обновления:

source: Various l10n and coding improvements to the project thanks to @NathanBnm
fr: Diverses améliorations de l'implémentation des traductions du projet par @NathanBnm
ru: Различные улучшения локализации и кода проекта благодаря @NathanBnm

source: Fixed a regression that the app didn't run at the first time launch
fr: Correction d'une regression qui empêchait l'application de démarrer la première fois
pt: Corrigida uma regressão em que a aplicação não iniciava ao abrir pela primeira vez
ru: Исправлена проблема, из-за которой приложение не запускалось с первого раза

source: Revived and updated valid translation files
fr: Mise à jour et correction des fichiers de traduction valides
pt: Ficheiros de tradução renovados e atualizados
ru: Исправлены и обновлены файлы переводов

source: Fixed timer control influences other instances
fr: Correction des contrôles du minuteur qui influençaient les autres instances
pt: Controlo do temporizador corrigido ao influencia outras instâncias
ru: Исправлена проблема, при которой контроль таймера влиял на другие экземпляры

source: Updated Lithuanian translation
fr: Mise à jour des traductions en lituanien
pt: Atualização da tradução Lituana
ru: Обновлён литовский перевод

source: Fixed timekeeping
fr: Correction de la conservation du temps
pt: Cronometragem corrigida
ru: Исправлен счёт времени

source: Fixed what happens when the app closes and there is a timer running
fr: Correction du comportement de l'application à la fermeture lorsqu'un minuteur est en cours
pt: Corrigido o que acontece quando a aplicação é fechada e tem um temporizador ativo
ru: Исправлена проблема, когда приложение закрывалось при работающем таймере

source: Fixed the notification going off again when you open the app
fr: Correction des notifications qui se désactivaient à l'ouverture de l'application
pt: Notificações sem limite corrigidas ao abrir a aplicação
ru: Исправлена ошибка, из-за которой уведомление снова исчезало при открытии приложения

source: Switched the build system from CMake to Meson
fr: Passage du système de compilation CMake à Meson
pt: Alteração do sistema de construção de CMake para Meson
ru: Система сборки изменена с CMake на Meson

source: Hourglass Daemon
fr: Service de Hourglass
ru: Служба Hourglass

source: Daemon that deals with Hourglass's alarms.
fr: Service qui gère les alarmes de Hourglass.
pt: Daemon que lida com os alarmes do Hourglass.
ru: Служба, отвечающая за будильники в Hourglass

source: A simple clock application that provides stopwatches, alarms, and timers
fr: Une simple application d'horloge qui fournit chronomètres, alarmes et minuteurs
pt: Uma aplicação de relógio simples que fornece cronômetros, alarmes e temporizadores

source: Alarm
pt: Alarme

source: Stopwatch
pt: Cronômetro
